flat_plate/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

#include        "$FOAM_CASE/include/initialConditions"

internalField   uniform $turb_nut;

boundaryField
{
    "(X_min|X_max)"
    {
        type            calculated;
        value           $internalField;
    }

    // Wall
    Y_max
    {
        type            symmetryPlane;
    }

    // Plate
    Y_min
    {
        type            nutUSpaldingWallFunction;
        value           $internalField;
    }

    "(Z_min|Z_max)"
    {
        type            empty;
    }
}

// ************************************************************************* //
